In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(0, datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 73, 'paid', None, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (1, datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 73, 'paid', None, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (4, datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM songplays WHERE song_id IS NOT NULL;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(483, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [6]:
%sql SELECT COUNT(*) FROM songplays

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [7]:
%sql SELECT DISTINCT COUNT(songplay_id) FROM songplays

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(6820,)]

In [6]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(73, 'Jacob', 'Klein', 'M', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid')]

In [21]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, Decimal('114.78159')),
 ('SOYMRWW12A6D4FAB14', 'The Moon And I (Ordinary Day Album Version)', 'ARKFYS91187B98E58F', 0, Decimal('267.7024')),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, Decimal('148.03546')),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832')),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, Decimal('266.39628'))]

In [30]:
%sql SELECT * FROM songs WHERE title LIKE '%Keepin It Real%';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, Decimal('114.78159'))]

In [8]:
%sql SELECT * FROM songs WHERE title LIKE '%Sunshine%';

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [9]:
%sql SELECT * FROM songs WHERE title LIKE '%Advice%';

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [10]:
%sql SELECT * FROM songs WHERE year = 100000

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [11]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', Decimal('NaN'), Decimal('NaN')),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892')),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN')),
 ('ARNTLGG11E2835DDB9', 'Clp', '', Decimal('NaN'), Decimal('NaN'))]

In [35]:
%sql SELECT * FROM artists WHERE name LIKE '%3OH%'

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [12]:
%sql SELECT COUNT(*) FROM artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(69,)]

In [13]:
%sql SELECT DISTINCT artist_id FROM artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
69 rows affected.

[('AR3JMC51187B9AE49D',),
 ('ARGSAFR1269FB35070',),
 ('ARP6N5A1187B99D1A3',),
 ('ARB29H41187B98F0EF',),
 ('AROGWRA122988FEE45',),
 ('ARPBNLO1187FB3D52F',),
 ('AR0RCMP1187FB3F427',),
 ('ARJIE2Y1187B994AB7',),
 ('AREDBBQ1187B98AFF5',),
 ('ARDR4AC1187FB371A1',),
 ('ARL7K851187B99ACD2',),
 ('AREVWGE1187B9B890A',),
 ('ARHHO3O1187B989413',),
 ('AREBBGV1187FB523D2',),
 ('ARAJPHH1187FB5566A',),
 ('ARIK43K1187B9AE54C',),
 ('ARQGYP71187FB44566',),
 ('AR7G5I41187FB4CE6C',),
 ('ARGUVEV1187B98BA17',),
 ('AR7SMBG1187B9B9066',),
 ('ARMJAGH1187FB546F3',),
 ('ARD7TVE1187B99BFB1',),
 ('ARULZCI1241B9C8611',),
 ('AR10USD1187B99F3F1',),
 ('ARMBR4Y1187B9990EB',),
 ('ARNPAGP1241B9C7FD4',),
 ('AR051KA1187B98B2FF',),
 ('ARIG6O41187B988BDD',),
 ('ARYKCQI1187FB3B18F',),
 ('ARBGXIG122988F409D',),
 ('ARKRRTF1187B9984DA',),
 ('ARLTWXK1187FB5A3F8',),
 ('ARXR32B1187FB57099',),
 ('AR62SOJ1187FB47BB5',),
 ('AR9AWNF1187B9AB0B4',),
 ('AR0IAWL1187B9A96D0',),
 ('AR8ZCNI1187B9A069B',),
 ('ARMAC4T1187FB3FA4C',),
 ('AREDL271187FB40F44',),
 ('ARI3BMM1187FB4255E',),
 ('AR1ZHYZ1187FB3C717',),
 ('ARC43071187B990240',),
 ('ARVBRGZ1187FB4675A',),
 ('AR7ZKHQ1187B98DD73',),
 ('ARNF6401187FB57032',),
 ('ARGCY1Y1187B9A4FA5',),
 ('ARD842G1187B997376',),
 ('ARNNKDK1187B98BBD5',),
 ('ARI2JSK1187FB496EF',),
 ('AR1Y2PT1187FB5B9CE',),
 ('ARNTLGG11E2835DDB9',),
 ('ARQ9BO41187FB5CF1F',),
 ('ARD0S291187B9B7BF5',),
 ('AR8IEZO1187B99055E',),
 ('AR558FS1187FB45658',),
 ('ARGSJW91187B9B1D6B',),
 ('ARAGB2O1187FB3A161',),
 ('ARKULSX1187FB45F84',),
 ('ARPFHN61187FB575F6',),
 ('ARDNS031187B9924F0',),
 ('ARKFYS91187B98E58F',),
 ('ARWB3G61187FB49404',),
 ('AROUOZZ1187B9ABE51',),
 ('AR36F9J1187FB406F1',),
 ('AR47JEX1187B995D81',),
 ('ARGIWFO1187B9B55B7',),
 ('AR5KOSW1187FB35FF4',),
 ('ARBEBBY1187B9B43DB',),
 ('ARH4Z031187B9A71F2',)]

In [9]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 0, 29, 48, 11, 2018, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).